# Bar Terminations Data As Rebar Shape Terminations Data Method

Source: https://www.revitapidocs.com/2026/05780996-d428-99ad-ba13-5b3c2902a2dd.htm

---

| Bar Terminations Data As Rebar Shape Terminations Data Method |
| --- |

Creates a new instance of RebarShapeTerminationsData from this.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarShapeTerminationsData AsRebarShapeTerminationsData()
```

```
Public Function AsRebarShapeTerminationsData As RebarShapeTerminationsData
```

```
public:
RebarShapeTerminationsData^ AsRebarShapeTerminationsData()
```

```
member AsRebarShapeTerminationsData : unit -> RebarShapeTerminationsData
```

#### Return Value

RebarShapeTerminationsData
Returns a new instance of RebarShapeTerminationsData from this. See Also

#### Reference

BarTerminationsData Class Autodesk.Revit.DB.Structure Namespace